#include "common.h"
#include "actor.h"
#include "SFX.h"
#include "1F1E0.h"

// "overlay 0" code for intro scene

typedef struct {
    /* 0x00 */ f32 unk_00;
    /* 0x04 */ s32 unk_04;
    /* 0x08 */ s32 unk_08;
    /* 0x0C */ s32 unk_0C;
} UnkStruct_func_801960BC_6D673C;

typedef struct {
    /* 0x00 */ u16 graphic_index;
    /* 0x02 */ u16 child_graphic_index;
    /* 0x04 */ s16 pos_x;
    /* 0x06 */ s16 pos_y;
    /* 0x08 */ s16 target_x;
    /* 0x0A */ s16 target_y;
} IntroActorMotion;


// struct to initalize boulders, 
// used in func_8019293C_6D2FBC
typedef struct {
    /* 0x00 */ s16 pos_x;
    /* 0x02 */ s16 pos_y;
    /* 0x04 */ s32 vel_x;
    /* 0x08 */ s32 vel_y;
    /* 0x0C */ s32 vel_z;
    /* 0x10 */ f32 scale;
} IntroBoulderInit;


extern u8 D_800BE70C;
extern s16 D_800E1604[];
extern s16 D_800E5D30[];
extern s16 D_800E5E48[];
extern s16 D_800E8820[];
extern s16 D_800E8EAC[];
extern u16 D_800D85A8[];
extern IntroBoulderInit D_80198DE0_6D9460[];
extern s16 D_80199B30_6DA1B0;
extern UnkStruct_func_801960BC_6D673C D_80199070_6D96F0[];
extern UnkStruct_func_801960BC_6D673C D_80199090_6D9710[];
extern UnkStruct_func_801960BC_6D673C D_801990B0_6D9730[];
extern UnkStruct_func_801960BC_6D673C D_801990D0_6D9750[];
extern UnkStruct_func_801960BC_6D673C D_80199100_6D9780[];
extern IntroActorMotion D_801993C0_6D9A40[];
extern s16 D_801993F0_6D9A70[];
extern s16 D_80199438_6D9AB8[];
extern void func_80027018(u16 arg0);
extern s32 func_8008412C(u16 arg0, f32 arg1, f32 arg2, u16 arg3);
extern void func_80096AC4(u16 actor_index);

void func_80192100_6D2780(u16 arg0, u16 arg1, u16 arg2, u16 arg3, s16 arg4, s16 arg5, s16 arg6);
