#include "common.h"
#include "28EF0.h"
#include "7D8E0.h"

// Actor 0x150->0x18F; possibly implies large union for this range with subtypes for specific actors
typedef struct {
    /* 0x00 */ s8 unk_00;
    /* 0x01 */ s8 unk_01;
    union {
        /* 0x02 */ s16 unk_02;
        /* 0x02 */ u8 unk_02_u8[2];
    };
    /* 0x04 */ s8 unk_04;
    /* 0x05 */ s8 unk_05;
    /* 0x06 */ s8 unk_06;
    /* 0x07 */ s8 pad_07;
    /* 0x08 */ s16 unk_08;
    /* 0x0A */ s16 unk_0A;
    /* 0x0C */ s16 unk_0C;
    /* 0x0E */ u8 pad_0E[0x1A];
    /* 0x28 */ s8 unk_28;
    /* 0x29 */ u8 pad_29[3];
    /* 0x2C */ s8 unk_2C;
    /* 0x2D */ s8 unk_2D;
    /* 0x2E */ s8 unk_2E;
    /* 0x2F */ s8 unk_2F;
    /* 0x30 */ s8 unk_30;
    /* 0x31 */ s8 unk_31;
    /* 0x32 */ u8 pad_32[6];
    /* 0x38 */ s16 unk_38;
    /* 0x3A */ s16 unk_3A;
    /* 0x3C */ s16 unk_3C;
    /* 0x3E */ s16 unk_3E;
} Overlay_7A13D0_Actor_State; /* sizeof = 0x40 */

typedef struct {
    /* 0x00 */ u16 timer;
    /* 0x02 */ u16 unk_02;
} Overlay_7A13D0_Spawn_Record; /* sizeof = 0x04 */

typedef struct {
    /* 0x00 */ u16 unk_00;
    /* 0x02 */ u16 unk_02;
    /* 0x04 */ u8 unk_04;
    /* 0x05 */ u8 unk_05;
    /* 0x06 */ u8 pad_06[2];
    /* 0x08 */ f32 unk_08;
} Overlay_7A13D0_Unk_801B6188; /* sizeof = 0x0C */

typedef void (*Overlay_7A13D0_State_Func)(u16 actor_index, Overlay_7A13D0_Actor_State* state);

extern s16 D_800E1384[];
extern s16 D_800E2274[];
extern u8 D_801376A8[];
extern u8 D_801376AC[];
extern u8 D_801376B0[];
extern u8 D_801376B4[];
extern u8 D_801376B8[];

extern void func_80067E50(u16 actor_index, void* arg1);
extern s32 func_800734C4(u16 arg0, s32 arg1);
extern s32 func_80073558(u16 actor_index, s32 arg1);

void func_801A85E0_771AB0(u16 actor_index, f32 arg1);
void func_801B0900_7A1410(u16 actor_index, Overlay_7A13D0_Actor_State* state);
void func_801B0AB8_7A15C8(u16 actor_index, Overlay_7A13D0_Actor_State* state);
void func_801B0D98_7A18A8(u16 actor_index, Overlay_7A13D0_Actor_State* state);
void func_801B0DF0_7A1900(u16 actor_index, Overlay_7A13D0_Actor_State* state);
void func_801B1184_7A1C94(u16 actor_index, Overlay_7A13D0_Actor_State* state);
