#include "common.h"
#include "7D8E0.h"

typedef struct Overlay_7A6E60_Graphic_Index_Table {
    /* 0x00 */ u16 indices[4];
} Overlay_7A6E60_Graphic_Index_Table; /* sizeof = 0x08 */

typedef struct Overlay_7A6E60_Actor_Spawn_Record {
    /* 0x00 */ s16 positionX;
    /* 0x02 */ u16 positionY;
    /* 0x04 */ u16 unk_04;
    /* 0x06 */ u16 unk_06;
} Overlay_7A6E60_Actor_Spawn_Record; /* sizeof = 0x08 */

typedef struct Overlay_7A6E60_Graphic_Spawn_Record {
    /* 0x00 */ u16 graphicFlags;
    /* 0x02 */ u16 positionX;
    /* 0x04 */ u16 positionY;
} Overlay_7A6E60_Graphic_Spawn_Record; /* sizeof = 0x06 */

typedef struct Overlay_7A6E60_Spawn_Config {
    /* 0x00 */ s16 positionX;
    /* 0x02 */ s16 positionZ;
    /* 0x04 */ s16 unused_04;
    /* 0x06 */ s16 unused_06;
    /* 0x08 */ s16 behavior;
} Overlay_7A6E60_Spawn_Config; /* sizeof = 0x0A */

typedef struct Overlay_7A6E60_Init_Record {
    /* 0x00 */ u16 unk_00;
    /* 0x02 */ u16 unk_02;
    /* 0x04 */ u16 unk_04;
    /* 0x06 */ u16 timer;
    /* 0x08 */ u16 unk_08;
    /* 0x0A */ u16 actorType;
} Overlay_7A6E60_Init_Record; /* sizeof = 0x0C */

extern void* D_800D1968[];
extern u8 D_800D9AF4[];
extern u8 D_800D9B04[];
extern u8 D_800D9B14[];
extern u8 D_800D9B24[];
extern u8 D_800D9B34[];
extern u8 D_800D9B44[];
extern s16 D_800E1750[];
extern s16 D_800E176C[];
extern s16 D_800E17A4[];
extern s16 D_800E17DC[];
extern s16 D_800E17F8[];
extern s16 D_800E1840[];
extern s16 D_800E19C0[];
extern s16 D_800E19E8[];
extern s16 D_800E1BF4[];
extern s16 D_800E1C00[];
extern s16 D_800E1C9C[];
extern s16 D_800E1CB4[];
extern s16 D_800E1D0C[];
extern s16 D_800E2274[];
extern s16 D_800E22A8[];
extern s16 D_800E22B4[];

Overlay_7A6E60_Init_Record D_801B4E90_7AB410[3] = {
    { 1, 0, 0, 0x1000, 0x1110, 0x0103 },
    { 2, 0, 0, 0x1000, 0x2220, 0x0103 },
    { 0, 0, 0, 0x1000, 0, 0x0103 },
};

Overlay_7A6E60_Init_Record D_801B4EB4_7AB434[3] = {
    { 3, 0x0100, 0, 0x1000, 0x3330, 0x0103 },
    { 4, 0x0200, 0, 0x1000, 0x4400, 0x0103 },
